{ "mapSize": 7,
  "entryPoint": "2,0",
  "map": {
    "4,3": {
      "name": "Computer Room",
      "description": "At the end of the room you notice that one of the computers is still turned on. When you approach the screen you see that someone left in a hurry. Most of their stuff is still here.",
      "items": {
        "basicItems": {
          "1": {
            "name": "knife",
            "canBe": "get, take, drop",
            "usedTo": ""
          },
          "2": {
            "name": "notebook",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "2,0": {
      "name": "Tram Stop",
      "description": "You're looking for ways to get into the building but there is a security guard blocking the entrance.",
      "items": {
        "basicItems": {
          "3": {
            "name": "wallet",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "5,1": {
      "name": "Cafeteria",
      "description": "Who is cooking so late?! Oh he looks angry, although you would also probably be if you had to cook this late.",
      "items": {
        "basicItems": {},
        "containers": {}
      }
    },
    "6,1": {
      "name": "Church",
      "description": "Hozier? Is that you?! Did somebody finally take you to church or did you take the tram here as well? God, you really are sleep-deprived. Looks like the rats have no respect for a holy place.",
      "items": {
        "basicItems": {
          "4": {
            "name": "poison",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "0,1": {
      "name": "Basement",
      "description": "Finally! After all of these hours and a single cup of coffee you have found Thilo. Don't forget to mention that your grade needs some revision;)",
      "items": {
        "basicItems": {},
        "containers": {}
      }
    },
    "2,1": {
      "name": "Lobby",
      "description": "When entering the building you almost slip on a doormat, weird, it usually isn't there. Everything is quieter than usual in the Lobby. The lights are off and it is, thus, darker than usual.",
      "items": {
        "basicItems": {
        },
        "containers": {
          "5": {
            "name": "doormat",
            "description": "You just lifted up the doormat and turns out that there is a key underneath it.",
            "canBe": "lift",
            "usedTo": "",
            "entities": {
              "6": {
                "name": "key",
                "canBe": "get, take, drop",
                "usedTo": ""
              }
            }
          }
        }
      },
      "obstacle" : {
        "name": "guard",
        "description": "The guard is blocking your entrance. You have to be clever to get in.",
        "toNeutralize": "wallet"
      }
    },
    "1,1": {
      "name": "North Side of the Lobby",
      "description": "There is a comfortable looking sofa and although you are tired FOCUS on your goal!! ",
      "items": {
        "basicItems": {
        },
        "containers": {
          "7": {
            "name": "sofa",
            "description": "You are not strong enough - and why would you want to carry a sofa around?",
            "entities": {
            }
          }
        }
      }
    },
    "3,1": {
      "name": "South Side of the Lobby",
      "description": "Although the lightning is dim you can see a water bottle standing on a table in the south corner of the lobby. And of course, as the whole Amsterdam is, the VU is also dealing with pest infestation. Thinking of this, thankfully, makes your late night cravings disappear.",
      "items": {
        "basicItems": {
          "8": {
            "name": "bottle",
            "canBe": "get, take, drop",
            "usedTo": ""
          },
          "9": {
            "name": "poison",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "4,1": {
      "name": "Spar",
      "description":  "What a temptation! A fully stocked Spar with even less security than usual, but the techno music is still on! Maybe a little bit wouldn't hurt. Maybe there is just a little bit left??",
      "items": {
        "basicItems": {
          "10": {
            "name": "pizza",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "5,2": {
      "name": "Donkey Kong",
      "description": "It looks like you have entered a rain forest looking room! The humidity in here makes yor glasses fog up but you easily get used to it. The sound of the birds makes you relax and for a second you even forget all the stress you are going through in this sleep-deprived adventure. LOOK OUT!! There is a sleeping Donkey Kong in the corner about to wake up.",
      "items": {
        "basicItems": {},
        "containers": {}
      }
    },
    "2,2": {
      "name": "Mirror Room",
      "description": "Wow! You've never seen this room before. Looking your best this late at night is certainly an impossible mission - did I look like this the entire party?! The room looks like something out of a circus. There are so many mirrors here!",
      "items": {
        "basicItems": {
        },
        "containers": {
          "11": {
            "name": "mirror",
            "description": "You just broke a mirror, why would you do that? Have you never heard of 7 years of bad luck?",
            "entities": {
            }
          }
        }
      }
    },
    "3,3": {
      "name": "Aula",
      "description": "Everything is prepared for this years graduation, ohhh, how you wish you had passed Computer Programming, maybe you would also be graduating. Perhaps if you save Thilo he will make an exception.",
      "items": {
        "basicItems": {},
        "containers": {}
      }
    },
    "5,3": {
      "name": "Maintenance Closet",
      "description": "You find your self in a very small space. It must be less than 5 square meters in here! It's almost as big as your overpriced Amsterdam studio apartment! As you are no stranger to this confined space you can see that the room you are in is a maintenance closet.",
      "items": {
        "basicItems": {
          "12": {
            "name": "broom",
            "canBe": "get, take, drop",
            "usedTo": ""
          },
          "13":{
            "name": "mop",
            "canBe": "get, take, drop",
            "usedTo": ""
          },
          "14": {
            "name": "bleach",
            "canBe": "get, take, drop",
            "usedTo": ""
          },
          "15": {
            "name": "gloves",
            "canBe": "get, take, drop",
            "usedTo": ""
          },
          "16": {
            "name": "goggles",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "2,5": {
      "name": "Bathroom",
      "description": "What is that smell?! Did someone forget to... Before you can finish your thought there is a loud barking sound coming from next door.",
      "items": {
        "basicItems": {},
        "containers": {}
      }
    },
    "3,5": {
      "name": "Women's Bathroom",
      "description": "Unfortunately (or perhaps fortunately) the sound isn't coming from here.",
      "items": {
        "basicItems": {},
        "containers": {}
      }
    },
    "1,5": {
      "name": "Men's Bathroom",
      "description": "You sure are happy that you had that pizza with you. The dog looks so calm now. Isn't it a bit dangerous to keep it in the bathroom?",
      "items": {
        "basicItems": {
          "17": {
            "name": "poison",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      },
      "obstacle": {
        "name":"dog",
        "description": "As soon as you try to open the door there is a big dog coming towards you. Who the hell forgot their dog in the university?! ",
        "toNeutralize": "pizza"
      }
    },
    "2,3": {
      "name": "TA Office",
      "description": "What an unfamiliar place, the TA office. You wonder whether they talk about you during their meetings and how you have missed almost all of the practicals. Maybe there is some stuff around here?",
      "items": {
        "basicItems": {
          "18": {
            "name": "card",
            "canBe": "get, take, drop",
            "usedTo": ""
          },
          "19": {
            "name": "exams",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "2,4": {
      "name": "Fish Bowl",
      "description": "Ohh, the fish bowl class, you can never focus on what the lecturer is saying with so many things happening around you. You've never seen this room so empty as you always arrive late to class and there are no seats left. Next to some white board markers you see a bit of poison bits, maybe this university should hire someone to deal with this problem professionally. ",
      "items": {
        "basicItems": {
          "20": {
            "name": "poison",
            "canBe": "get, take, drop",
            "usedTo": ""
          }
        },
        "containers": {}
      }
    },
    "1,3": {
      "name": "Student Desk",
      "description": "Take a moment to reflect on your journey. Next to the lounge area you see a coffee machine - thirsty?",
      "items": {
        "basicItems": {},
        "containers": {}
      }
    }
  }
}
